Конфигурация/Reports/ДвиженияПоРегистрамНакопления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ДвиженияПоРегистрамНакопления</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтратегииИндивидуальногоИнвестирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/МНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МНО</Name>
			<BasedOn>
				<xr:Item>Document.Распоряжение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваМНО</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Reports/ДвиженияПоРегистрамНакопления/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.Период = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Форма.ВидПериода, Форма.НачалоПериода, Форма.КонецПериода);
		
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(Форма.ВидПериода, Элементы.ГруппаПоляВводаПериода);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВидПериодаПриИзменении(Элемент, ВидПериода, ЭтаФорма.НачалоПериода, ЭтаФорма.КонецПериода, Период);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодПриИзменении(Элемент, Период, ЭтаФорма.НачалоПериода, ЭтаФорма.КонецПериода);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		ВидПериода, Период, ЭтаФорма.НачалоПериода, ЭтаФорма.КонецПериода);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ВидПериода, Период, ЭтаФорма.НачалоПериода, ЭтаФорма.КонецПериода);
		
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		ВидПериода, Период, ЭтаФорма.НачалоПериода, ЭтаФорма.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		ВидПериода, Период, ЭтаФорма.НачалоПериода, ЭтаФорма.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаДеньПриИзменении(Элемент)
	
	ЭтаФорма.КонецПериода = КонецДня(ЭтаФорма.НачалоПериода);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрВывода(ИсполняемыйКомпоновщикНастроек, Параметр, Значение)

	ЗначениеПараметра = ИсполняемыйКомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти(Параметр); 
	ЗначениеПараметра.Использование = Истина; 
	ЗначениеПараметра.Значение = Значение;

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметр(ИсполняемыйКомпоновщикНастроек, Параметр, Значение)

	ЗначениеПараметра = ИсполняемыйКомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Параметр); 
	ЗначениеПараметра.Использование = Истина; 
	ЗначениеПараметра.Значение = Значение;

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Перем ДанныеРасшифровкиОбъект;
	
	Механизм = "Отчет.ДвиженияПоРегистрамНакопления.Форма.СформироватьНаСервере()";
	ДопПараметрыВыполнения = Новый Структура("Период,Организация,СчетДоверительногоУправления,Регистр");
	ЗаполнитьЗначенияСвойств(ДопПараметрыВыполнения, ЭтаФорма);
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(РеквизитФормыВЗначение("Отчет"),, ДопПараметрыВыполнения);
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ОборотныйРегистр = (Метаданные.РегистрыНакопления[ЭтаФорма.Регистр].ВидРегистра =  Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресСхемыИсполненногоОтчета);
	
    //2.1 определяем структуру 
	//ИсполняемыйКомпоновщикНастроек.Настройки.Структура.Очистить();
	//
	//ПоляКомпоновкиДанных = ИсполняемыйКомпоновщикНастроек.Настройки.Выбор.Элементы;
	//ДобавитьВыбранноеПоле(ПоляКомпоновкиДанных, "Поле");
	//ДобавитьВыбранноеПоле(ПоляКомпоновкиДанных, "Регистратор");
	//ДобавитьВыбранноеПоле(ПоляКомпоновкиДанных, "НомерСтроки");
	//
	//ДобавитьГруппуПолей(ПоляКомпоновкиДанных, "Приход", ЭтаФорма.Регистр);
	//ДобавитьГруппуПолей(ПоляКомпоновкиДанных, "Расход", ЭтаФорма.Регистр);
	//ДобавитьГруппуПолей(ПоляКомпоновкиДанных, "Остаток", ЭтаФорма.Регистр);
	//
	//НоваяГруппировка = ИсполняемыйКомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//НоваяГруппировка.Использование = Истина;
	//
	//НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	//4. Параметры
	УстановитьПараметр(ИсполняемыйКомпоновщикНастроек, "НП", НачалоДня(ЭтаФорма.НачалоПериода));
	//УстановитьПараметр(ИсполняемыйКомпоновщикНастроек, "НачалоПериода", НачалоДня(ЭтаФорма.ВыборПериода.ДатаНачала));
	УстановитьПараметр(ИсполняемыйКомпоновщикНастроек, "КП", КонецДня(ЭтаФорма.КонецПериода));
	УстановитьПараметр(ИсполняемыйКомпоновщикНастроек, "Организация", ЭтаФорма.Организация);
	Если НЕ ЭтаФорма.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПустаяСсылка() Тогда
		УстановитьПараметр(ИсполняемыйКомпоновщикНастроек, "СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
	КонецЕсли;
	
	Если НЕ ЭтаФорма.МакетОформления = "" Тогда
		УстановитьПараметрВывода(ИсполняемыйКомпоновщикНастроек, "МакетОформления", ЭтаФорма.МакетОформления);
	КонецЕсли;
	
	Если НЕ ОборотныйРегистр Тогда
	
		ПрименитьРучнуюНастройкуПолей();
	
	КонецЕсли; 
	//"РасположениеРеквизитов"
	
	
    //3. готовим макет 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровкиОбъект = Новый ДанныеРасшифровкиКомпоновкиДанных;
	ДанныеРасшифровкиОбъект.Настройки = ИсполняемыйКомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ИсполняемыйКомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровкиОбъект);
	АдресСхемыИсполненногоОтчета = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ?(АдресСхемыИсполненногоОтчета <> "", АдресСхемыИсполненногоОтчета, УникальныйИдентификатор));
	
	//4. исполняем макет 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровкиОбъект, Ложь);
	
    //5. выводим результат 
	Результат.Очистить();
	ПроцессорВыводаРезультатаОтчета = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаОтчета.УстановитьДокумент(Результат);
	ПроцессорВыводаРезультатаОтчета.НачатьВывод();
	ПроцессорВыводаРезультатаОтчета.Вывести(ПроцессорКомпоновкиДанных);
	ПроцессорВыводаРезультатаОтчета.ЗакончитьВывод();
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(Результат, РеквизитФормыВЗначение("Отчет").Метаданные().ПолноеИмя());	
	
	Если ДанныеРасшифровкиОбъект <> Неопределено Тогда
		АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОбъект, УникальныйИдентификатор);
	КонецЕсли;
	
	//Элементы.ИсполняемыйКомпоновщикНастроекНастройки.ТекущаяСтрока = ИсполняемыйКомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(ИсполняемыйКомпоновщикНастроек.Настройки.Структура[0]);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать()
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВернутьПоля(Регистр, ИмяТаблицы, Вариант, ПорядокПП, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ) //Вариант: 1-остатки на начало, 2 - остатки на конец и обороты, 3 - для итоговой таблицы

	Поля = Символы.ПС;	

	Если Вариант <> 3 Тогда
		
		Для каждого ИзмерениеРегистраНакопления Из Метаданные.РегистрыНакопления[Регистр].Измерения Цикл
			Если ИзмерениеРегистраНакопления.Имя = "Организация" ИЛИ ИзмерениеРегистраНакопления.Имя = "Клиент" Тогда
				Продолжить;
			ИначеЕсли ИзмерениеРегистраНакопления.Имя = "СчетДоверительногоУправления" Тогда
				Продолжить;
			КонецЕсли;
			Поля = Поля + Символы.Таб + ИмяТаблицы + "." + ИзмерениеРегистраНакопления.Имя + "," + Символы.ПС;
		КонецЦикла;
		
		Если ДетализацияПоСчетуДУ Тогда
			Поля = Поля + Символы.Таб + ИмяТаблицы + ".СчетДоверительногоУправления КАК СчетДоверительногоУправления," + Символы.ПС;
		ИначеЕсли ДетализацияПоКлиенту Тогда
			Поля = Поля + Символы.Таб + "КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент," + Символы.ПС;
		ИначеЕсли ДетализацияПоСтратегии Тогда
			Поля = Поля + Символы.Таб + "СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия КАК Стратегия," + Символы.ПС;
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
		Если Вариант = 1 Тогда
			Если ОборотныйРегистр Тогда
				Поля = Поля + Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Оборот," + Символы.ПС;
			Иначе
				Поля = Поля + Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Остаток," + Символы.ПС + 
							  Символы.Таб + "0 КАК " + РесурсРегистраНакопления.Имя + "Приход," + Символы.ПС +
							  Символы.Таб + "0 КАК " + РесурсРегистраНакопления.Имя + "Расход," + Символы.ПС;
			КонецЕсли;
		ИначеЕсли Вариант = 2 Тогда
			Если ОборотныйРегистр Тогда
				Поля = Поля + Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Оборот," + Символы.ПС;
			Иначе
				Поля = Поля + Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "КонечныйОстаток КАК " + РесурсРегистраНакопления.Имя + "Остаток," + Символы.ПС + 
							  Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Приход," + Символы.ПС + 
							  Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Расход," + Символы.ПС;
			КонецЕсли;
		ИначеЕсли Вариант = 3 Тогда
			Если ОборотныйРегистр Тогда
				Поля = Поля + Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Оборот," + Символы.ПС;
			Иначе
				Поля = Поля + Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Остаток," + Символы.ПС + 
							  Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Приход," + Символы.ПС + 
							  Символы.Таб + ИмяТаблицы + "." + РесурсРегистраНакопления.Имя + "Расход," + Символы.ПС;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Вариант = 3 Тогда
		Если ДетализацияПоСчетуДУ Тогда
			Поля = Поля + Символы.Таб + ИмяТаблицы + ".СчетДоверительногоУправления КАК СчетДоверительногоУправления," + Символы.ПС;
		ИначеЕсли ДетализацияПоКлиенту Тогда
			Поля = Поля + Символы.Таб + ИмяТаблицы + ".Клиент КАК Клиент," + Символы.ПС;
		ИначеЕсли ДетализацияПоСтратегии Тогда
			Поля = Поля + Символы.Таб + ИмяТаблицы + ".Стратегия КАК Стратегия," + Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	
	Если Вариант <> 3 Тогда
		Поля = Поля + Символы.Таб + Строка(ПорядокПП) + " КАК Порядок," + Символы.ПС;
		Если ПорядокПП = 1 Тогда
			Поля = Поля + Символы.Таб + """Сальдо на начало"" КАК Поле," + Символы.ПС +
						  Символы.Таб + "ДОБАВИТЬКДАТЕ(&НП,Секунда,-1) КАК Период," + Символы.ПС + 
						  Символы.Таб + "ЗНАЧЕНИЕ(Документ.МНО.ПустаяСсылка) КАК Регистратор," + Символы.ПС + 
						  Символы.Таб + "0 КАК НомерСтроки" + Символы.ПС;
		ИначеЕсли ПорядокПП = 2 Тогда
			Поля = Поля + Символы.Таб + ИмяТаблицы + ".Период КАК Поле," + Символы.ПС +
						  Символы.Таб + ИмяТаблицы + ".Период КАК Период," + Символы.ПС +
						  Символы.Таб + ИмяТаблицы + ".Регистратор КАК Регистратор," + Символы.ПС + 
						  Символы.Таб + ИмяТаблицы + ".НомерСтроки" + Символы.ПС;
		ИначеЕсли ПорядокПП = 3 Тогда
			Поля = Поля + Символы.Таб + """Сальдо на конец"" КАК Поле," + Символы.ПС +
						  Символы.Таб + "ДОБАВИТЬКДАТЕ(&КП,Секунда,1) КАК Период," + Символы.ПС + 
						  Символы.Таб + "ЗНАЧЕНИЕ(Документ.МНО.ПустаяСсылка) КАК Регистратор," + Символы.ПС + 
						  Символы.Таб + "0 КАК НомерСтроки" + Символы.ПС;
		КонецЕсли;
	Иначе
		Поля = Поля + Символы.Таб + ИмяТаблицы + ".Порядок," + Символы.ПС + 
					  Символы.Таб + ИмяТаблицы + ".Поле КАК Период," + Символы.ПС + 
					  Символы.Таб + ИмяТаблицы + ".Период КАК Период1," + Символы.ПС + 
					  Символы.Таб + ИмяТаблицы + ".Регистратор КАК Документ," + Символы.ПС + 
					  Символы.Таб + ИмяТаблицы + ".НомерСтроки" + Символы.ПС;
	КонецЕсли;
	
	Возврат Поля;
	
КонецФункции

&НаСервере
Функция ВернутьТекстЗапроса(ИмяРегистра, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ)
	
	УсловиеСчетДУ = "";
	
	Если НЕ ЭтаФорма.СчетДоверительногоУправления = Справочники.СчетаДоверительногоУправления.ПустаяСсылка() Тогда
		УсловиеСчетДУ = " И %ИмяТаблицы%.СчетДоверительногоУправления = &СчетДоверительногоУправления";
	КонецЕсли;
	
	ТекстЗапроса = ?(ОборотныйРегистр, "",
		" ВЫБРАТЬ РАЗРЕШЕННЫЕ " +
			ВернутьПоля(ИмяРегистра, ИмяРегистра + "Остатки", 1, 1, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ) + 
		"ПОМЕСТИТЬ ОстаткиНачальные" + Символы.ПС +
		"ИЗ РегистрНакопления." + ИмяРегистра + ".Остатки(&НП, ) КАК " + ИмяРегистра + "Остатки"  + Символы.ПС +
		?(НЕ ДетализацияПоСчетуДУ И ДетализацияПоСтратегии, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&КП, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних " +
				Символы.ПС + "ПО " + ИмяРегистра + "Остатки.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления" + Символы.ПС, "") +
		?(НЕ ДетализацияПоСчетуДУ И ДетализацияПоКлиенту, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КП, ) КАК КлиентыДоверительногоУправленияСрезПоследних " + 
				Символы.ПС + "ПО " + ИмяРегистра + "Остатки.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления " + Символы.ПС, "") +
		"ГДЕ " + ИмяРегистра + "Остатки.Организация = &Организация" + СтрЗаменить(УсловиеСчетДУ, "%ИмяТаблицы%", ИмяРегистра + "Остатки") + Символы.ПС +
		";" + Символы.ПС + Символы.ПС) +
		"////////////////////////////////////////////////////////////////////////////////" + Символы.ПС +
		" ВЫБРАТЬ РАЗРЕШЕННЫЕ " +
			ВернутьПоля(ИмяРегистра, ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты", 2, 3, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ) + 
		"ПОМЕСТИТЬ ОстаткиКонечные" + Символы.ПС +
		"ИЗ РегистрНакопления." + ИмяРегистра + "." + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты(&НП, &КП, Период, " + ?(ОборотныйРегистр, "", ",")+ " ) КАК " + ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты"  + Символы.ПС +
		?(НЕ ДетализацияПоСчетуДУ И ДетализацияПоСтратегии, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&КП, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних " +
				Символы.ПС + "ПО " + ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ") + "Обороты.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления" + Символы.ПС, "") +
		?(НЕ ДетализацияПоСчетуДУ И ДетализацияПоКлиенту, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КП, ) КАК КлиентыДоверительногоУправленияСрезПоследних " + 
				Символы.ПС + "ПО " + ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ") + "Обороты.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления " + Символы.ПС, "") +
		"ГДЕ " + ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты.Организация = &Организация" + СтрЗаменить(УсловиеСчетДУ, "%ИмяТаблицы%", ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ") + "Обороты") + Символы.ПС +
		";" + Символы.ПС + Символы.ПС +
		"////////////////////////////////////////////////////////////////////////////////" + Символы.ПС +
		" ВЫБРАТЬ РАЗРЕШЕННЫЕ " +
			ВернутьПоля(ИмяРегистра, ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты", 2, 2, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ) + 
		"ПОМЕСТИТЬ Обороты" + Символы.ПС +
		"ИЗ РегистрНакопления." + ИмяРегистра + "." + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты(&НП, &КП, Запись, " + ?(ОборотныйРегистр, "", "Движения,")+ " ) КАК " + ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты"  + Символы.ПС +
		?(НЕ ДетализацияПоСчетуДУ И ДетализацияПоСтратегии, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&КП, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних " +
				Символы.ПС + "ПО " + ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ") + "Обороты.СчетДоверительногоУправления = СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления" + Символы.ПС, "") +
		?(НЕ ДетализацияПоСчетуДУ И ДетализацияПоКлиенту, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КП, ) КАК КлиентыДоверительногоУправленияСрезПоследних " + 
				Символы.ПС + "ПО " + ИмяРегистра+ ?(ОборотныйРегистр, "", "ОстаткиИ") + "Обороты.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления " + Символы.ПС, "") +
		"ГДЕ " + ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ")+ "Обороты.Организация = &Организация" + СтрЗаменить(УсловиеСчетДУ, "%ИмяТаблицы%", ИмяРегистра + ?(ОборотныйРегистр, "", "ОстаткиИ") + "Обороты") + Символы.ПС +
		";" + Символы.ПС + Символы.ПС +
		"////////////////////////////////////////////////////////////////////////////////" + Символы.ПС +
		" ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (" +
		" ВЫБРАТЬ " +
			ВернутьПоля(ИмяРегистра, "Обороты", 3, 1, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ) + 
		"ИЗ Обороты КАК Обороты" + Символы.ПС + Символы.ПС + 
		?(ОборотныйРегистр, "",
		"ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС + 
		" ВЫБРАТЬ " +
			ВернутьПоля(ИмяРегистра, "ОстаткиНачальные", 3, 1, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ) + 
		"ИЗ ОстаткиНачальные КАК ОстаткиНачальные"  + Символы.ПС + Символы.ПС) + 
		"ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС + 
		" ВЫБРАТЬ " +
			ВернутьПоля(ИмяРегистра, "ОстаткиКонечные", 3, 1, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ) + 
		"ИЗ ОстаткиКонечные КАК ОстаткиКонечные) КАК ВсеОстатки" + Символы.ПС + 
		"УПОРЯДОЧИТЬ ПО" + Символы.ПС + 
		"Период1"  
		; 
		
	Возврат ТекстЗапроса;	

КонецФункции

&НаСервере
Процедура ДобавитьВыбранноеПоле(КоллекцияПолей, ИмяПоля)

	ВыбранноеПолеКомпоновкиДанных = КоллекцияПолей.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);

КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуПолей(ПоляКомпоновкиДанных, Заголовок, ИмяРегистра)

	ЕстьКоличество = Ложь;
	Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
		Если РесурсРегистраНакопления.Имя = "Количество" Тогда
			ЕстьКоличество = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВерхняяГруппа = ПоляКомпоновкиДанных.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ВерхняяГруппа.Заголовок = Заголовок;
	Если ЕстьКоличество Тогда
		ВерхняяГруппа.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;
	Иначе
		ВерхняяГруппа.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	КонецЕсли;
	
	Если ЕстьКоличество Тогда
		ВыбранноеПоле = ВерхняяГруппа.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Количество" + Заголовок);
		ВыбранноеПоле.Заголовок = "Количество";
		
		ГруппаСуммы = ВерхняяГруппа.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаСуммы.Заголовок = "Суммы";
		ГруппаСуммы.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	Иначе
		ГруппаСуммы = ВерхняяГруппа;
	КонецЕсли;
	
	Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
		Если РесурсРегистраНакопления.Имя = "Количество" Тогда
			Продолжить;
		КонецЕсли;
		ВыбранноеПоле = ГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(РесурсРегистраНакопления.Имя + Заголовок);
		ВыбранноеПоле.Заголовок = РесурсРегистраНакопления.Синоним;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОформляемоеПоле(КоллекцияПолей, ИмяПоля)

	ПолеОформления = КоллекцияПолей.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);

КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппуОформляемыхПолей(КоллекцияПолей, ИмяРегистра, ОборотныйРегистр)

	Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
		Если ОборотныйРегистр Тогда
			ДобавитьОформляемоеПоле(КоллекцияПолей, РесурсРегистраНакопления.Имя + "Оборот");
		Иначе
			ДобавитьОформляемоеПоле(КоллекцияПолей, РесурсРегистраНакопления.Имя + "Приход");
			ДобавитьОформляемоеПоле(КоллекцияПолей, РесурсРегистраНакопления.Имя + "Расход");
			ДобавитьОформляемоеПоле(КоллекцияПолей, РесурсРегистраНакопления.Имя + "Остаток");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПолеРесурса(Схема, РесурсРегистраНакопления, ВидРесурса)
	Поле = Схема.ПоляИтога.Добавить();
	Поле.Выражение = "Сумма("+РесурсРегистраНакопления.Имя + ВидРесурса + ")";
	Поле.ПутьКДанным = РесурсРегистраНакопления.Имя+ВидРесурса;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляВГруппировку(НоваяГруппировка, Заголовок, Вид)

	ВыбранноеПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок = "Период";
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Период" + Вид);
	
	ВыбранноеПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок = "Документ";
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Документ" + Вид);
	
	ВыбранноеПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Заголовок = "Номер строки";
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("НомерСтроки" + Вид);
	
	Если Этаформа.Регистр = "БухПартииЦенныхБумаг" Тогда
		
		НоваяГруппа = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		НоваяГруппа.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;
		НоваяГруппа.Заголовок = Заголовок;
		
		//Заголовок охеренно ВАЖЕН!!!!!!!!
		//СКДшка (сука-тварь-гадина) сливает группы колонок с одинаковым заголовком!!! 
		//Охренеть! 0_0
		
		НоваяГруппаКолво = НоваяГруппа.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		НоваяГруппаКолво.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
		НоваяГруппаКолво.Заголовок = " ";  //Тут 1 пробел!!!
		
		НоваяГруппаСуммы = НоваяГруппа.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		НоваяГруппаСуммы.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
		НоваяГруппаСуммы.Заголовок = "  "; //Тут 2 пробела!!!
		
		НоваяГруппаСуммыКупона = НоваяГруппа.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		НоваяГруппаСуммыКупона.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
		НоваяГруппаСуммыКупона.Заголовок = "   "; //Тут 3 пробела!!!
		//*********************
		ВыбранноеПоле = НоваяГруппаКолво.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Количество";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Количество" + Вид);
		
		ВыбранноеПоле = НоваяГруппаКолво.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Расходы при покупке в стоимости";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("РасходыПриПокупкеВСтоимости" + Вид);
		
		ВыбранноеПоле = НоваяГруппаКолво.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Сумма частичного погашения";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаЧастичногоПогашения" + Вид);
		
		ВыбранноеПоле = НоваяГруппаКолво.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Дисконт/Премия";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДисконтПремия" + Вид);
		
		ВыбранноеПоле = НоваяГруппаКолво.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Корректировка ЭСП";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("КорректировкаЭСП" + Вид);
		
		ВыбранноеПоле = НоваяГруппаКолво.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Корректировка ЭСП с начала года";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("КорректировкаЭСПСНачалаГода" + Вид);
		//*********************
		ВыбранноеПоле = НоваяГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Стоимость покупки";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СтоимостьПокупки" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Переоценка в стоимости";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ПереоценкаВСтоимости" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Стоимость";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Стоимость" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Дисконт/Премия начисленный";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДисконтПремияНачисленный" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Переоценка";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Переоценка" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Переоценка с начала года";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ПереоценкаСНачалаГода" + Вид);
		//*********************
		ВыбранноеПоле = НоваяГруппаСуммыКупона.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Стоимость покупки купона";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СтоимостьПокупкиКупона" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммыКупона.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Переоценка купона в стоимости";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ПереоценкаКупонаВСтоимости" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммыКупона.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Стоимость купона";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СтоимостьКупона" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммыКупона.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Дисконт/премия начисленный с начала года";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ДисконтПремияНачисленныйСНачалаГода" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммыКупона.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Переоценка купона";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ПереоценкаКупона" + Вид);
		
		ВыбранноеПоле = НоваяГруппаСуммыКупона.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Заголовок = "Переоценка купона с начала года";
		ВыбранноеПоле.Использование = Истина;
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ПереоценкаКупонаСНачалаГода" + Вид);
		//*********************
	Иначе
		
		ЕстьКоличество = Ложь;
		Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
			Если РесурсРегистраНакопления.Имя = "Количество" Тогда
				ЕстьКоличество = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьКоличество Тогда
		
			НоваяГруппа = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			НоваяГруппа.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;
			НоваяГруппа.Заголовок = Заголовок;
			
			НоваяГруппаКолво = НоваяГруппа.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			НоваяГруппаКолво.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
			НоваяГруппаКолво.Заголовок = " ";
			
			НоваяГруппаСуммы = НоваяГруппа.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			НоваяГруппаСуммы.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
			НоваяГруппаСуммы.Заголовок = "  ";
			
			Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
				Если РесурсРегистраНакопления.Имя = "Количество" Тогда
					ВыбранноеПоле = НоваяГруппаКолво.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				Иначе	
					ВыбранноеПоле = НоваяГруппаСуммы.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				КонецЕсли;
				ВыбранноеПоле.Заголовок = РесурсРегистраНакопления.Синоним;
				ВыбранноеПоле.Использование = Истина;
				ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(РесурсРегистраНакопления.Имя+Вид);
			КонецЦикла;
		Иначе	
			НоваяГруппа = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			НоваяГруппа.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
			НоваяГруппа.Заголовок = Заголовок;
			Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
				ВыбранноеПоле = НоваяГруппа.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВыбранноеПоле.Заголовок = РесурсРегистраНакопления.Синоним;
				ВыбранноеПоле.Использование = Истина;
				ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(РесурсРегистраНакопления.Имя+Вид);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеНабораДанных(НаборДанныхНастройкиПолей, ИмяПоля, Заголовок, ТипПоля)

	Поле = НаборДанныхНастройкиПолей.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = ИмяПоля;
	Поле.ПутьКДанным = ИмяПоля;
	Поле.Заголовок = Заголовок;
	Поле.ТипЗначения = ТипПоля;

КонецПроцедуры

&НаСервере
Процедура ИзменитьСхемуКомпоновкиДанных(ПерезаполнитьГруппировки, ПерезаполнятьНастройкуПолей = Истина)
	
	ЕстьИзмерениеСчетДУ = Метаданные.РегистрыНакопления[ЭтаФорма.Регистр].Измерения.Найти("СчетДоверительногоУправления") <> Неопределено;
	
	Если НЕ ЕстьИзмерениеСчетДУ Тогда
		СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	Элементы.СчетДоверительногоУправления.Доступность = ЕстьИзмерениеСчетДУ;
	
	ДетализацияПоСчетуДУ = ЕстьИзмерениеСчетДУ
							И ЭтаФорма.Параметры <> Неопределено
							И ЭтаФорма.Параметры.Свойство("Отбор")
							И ЭтаФорма.Параметры.Отбор <> Неопределено
							И ЭтаФорма.Параметры.Отбор.Свойство("СчетДоверительногоУправления");
	
	ДетализацияПоКлиенту = ЕстьИзмерениеСчетДУ
							И ЭтаФорма.Параметры <> Неопределено
							И ЭтаФорма.Параметры.Свойство("Отбор")
							И ЭтаФорма.Параметры.Отбор <> Неопределено
							И ЭтаФорма.Параметры.Отбор.Свойство("Клиент");
	
	ДетализацияПоСтратегии = ЕстьИзмерениеСчетДУ
							И ЭтаФорма.Параметры <> Неопределено
							И ЭтаФорма.Параметры.Свойство("Отбор")
							И ЭтаФорма.Параметры.Отбор <> Неопределено
							И ЭтаФорма.Параметры.Отбор.Свойство("Стратегия");
	
	ОборотныйРегистр = (Метаданные.РегистрыНакопления[ЭтаФорма.Регистр].ВидРегистра =  Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты);
	
	Схема = Новый СхемаКомпоновкиДанных;
    
    //1.1 определяем источник данных для схемы 
    Источник = Схема.ИсточникиДанных.Добавить();
    Источник.Имя = "ЛокальнаяБаза";
    Источник.СтрокаСоединения = "";
    Источник.ТипИсточникаДанных = "Local";
    
    //1.2 определяем набор данных 
	НаборДанных = Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
    НаборДанных.Имя = "Продажи";
    НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
//    НаборДанных.АвтоЗаполнениеДоступныхПолей = Ложь;
    НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
    НаборДанных.Запрос = (ВернутьТекстЗапроса(ЭтаФорма.Регистр, ОборотныйРегистр, ДетализацияПоСтратегии, ДетализацияПоКлиенту, ДетализацияПоСчетуДУ));
                       
	////1.3 определяем ресурсы 
	//Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
	//	ДобавитьПолеРесурса(Схема, РесурсРегистраНакопления, "НачальныйОстаток");
	//	ДобавитьПолеРесурса(Схема, РесурсРегистраНакопления, "Приход");
	//	ДобавитьПолеРесурса(Схема, РесурсРегистраНакопления, "Расход");
	//	ДобавитьПолеРесурса(Схема, РесурсРегистраНакопления, "КонечныйОстаток");
	//КонецЦикла;
	
    //2. создаем настройки для схемы 
    НастройкиКомпоновкиДанных = Схема.НастройкиПоУмолчанию;
	НастройкиКомпоновкиДанных.Структура.Очистить();
	
    //2.1 определяем структуру
	ПоляКомпоновкиДанных = НастройкиКомпоновкиДанных.Выбор.Элементы;
	
	ДобавитьВыбранноеПоле(ПоляКомпоновкиДанных, "Период");
	ДобавитьВыбранноеПоле(ПоляКомпоновкиДанных, "Документ");
	ДобавитьВыбранноеПоле(ПоляКомпоновкиДанных, "НомерСтроки");
	
	Если ОборотныйРегистр Тогда
		ДобавитьГруппуПолей(ПоляКомпоновкиДанных, "Оборот", ЭтаФорма.Регистр);
	Иначе
		ДобавитьГруппуПолей(ПоляКомпоновкиДанных, "Приход", ЭтаФорма.Регистр);
		ДобавитьГруппуПолей(ПоляКомпоновкиДанных, "Расход", ЭтаФорма.Регистр);
		ДобавитьГруппуПолей(ПоляКомпоновкиДанных, "Остаток", ЭтаФорма.Регистр);
	КонецЕсли;
	
	Элементы.НастройкаПолей.Видимость = Не ОборотныйРегистр;
	Если Не ОборотныйРегистр и ПерезаполнятьНастройкуПолей Тогда
		
		СхемаНастройкиПолей = Новый СхемаКомпоновкиДанных;
    
	    ЗаполнитьЗначенияСвойств(СхемаНастройкиПолей.ИсточникиДанных.Добавить(), Источник);
		НаборДанныхНастройкиПолей = СхемаНастройкиПолей.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
		НаборДанныхНастройкиПолей.Имя = "Продажи";
		НаборДанныхНастройкиПолей.ИмяОбъекта = "Продажи";
	    НаборДанныхНастройкиПолей.ИсточникДанных = "ЛокальнаяБаза";
		
		МассивТиповДокументов = Новый Массив;
		
		Для каждого МетаданныеДокумент Из Метаданные.Документы Цикл
			Для каждого МетаданныеДокументДвижение Из МетаданныеДокумент.Движения Цикл
				Если МетаданныеДокументДвижение = Метаданные.РегистрыНакопления[Этаформа.Регистр] Тогда
					МассивТиповДокументов.Добавить(Тип("ДокументСсылка." + МетаданныеДокумент.Имя));
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ДобавитьПолеНабораДанных(НаборДанныхНастройкиПолей, "Период", "Период", Новый ОписаниеТипов("Строка"));
		ДобавитьПолеНабораДанных(НаборДанныхНастройкиПолей, "Документ", "Документ", Новый ОписаниеТипов(МассивТиповДокументов));
		ДобавитьПолеНабораДанных(НаборДанныхНастройкиПолей, "НомерСтроки", "Номер строки", Новый ОписаниеТипов("Число"));
		
		Для каждого РесурсРегистраНакопления Из Метаданные.РегистрыНакопления[Этаформа.Регистр].Ресурсы Цикл
			ДобавитьПолеНабораДанных(НаборДанныхНастройкиПолей, РесурсРегистраНакопления.Имя, РесурсРегистраНакопления.Имя, РесурсРегистраНакопления.Тип);
			ДобавитьПолеРесурса(СхемаНастройкиПолей, РесурсРегистраНакопления, "Остаток");
		КонецЦикла;
		
		НастройкиПолей = СхемаНастройкиПолей.НастройкиПоУмолчанию;
		ДобавитьПоляВГруппировку(НастройкиПолей, "Остаток", "");
		
		АдресСхемыНастройкиПолей = ПоместитьВоВременноеХранилище(СхемаНастройкиПолей, ?(АдресСхемыНастройкиПолей <> "", АдресСхемыНастройкиПолей, УникальныйИдентификатор));
		КомпоновщикНастройкиПолей.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыНастройкиПолей));
		КомпоновщикНастройкиПолей.ЗагрузитьНастройки(НастройкиПолей);
	
	КонецЕсли; 
	
	НоваяГруппировка = НастройкиКомпоновкиДанных.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	НоваяГруппировка.Использование = Истина;
	
	НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));

	//Оформление
	ЭлементОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ОтборОформления = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Порядок");
	ОтборОформления.ПравоеЗначение = 2;
	
	ЗначениеОформления = ЭлементОформления.Оформление.Элементы[0]; //цвет фона
	ЗначениеОформления.Значение = ЦветаСтиля.ЦветФонаГруппировкиОтчета1;
	ЗначениеОформления.Использование = Истина;
	ЗначениеОформления = ЭлементОформления.Оформление.Элементы[5]; //шрифт
	ЗначениеОформления.Значение = Новый Шрифт("",8,Истина,Неопределено,Неопределено,Неопределено);
	ЗначениеОформления.Использование = Истина;
	
	ДобавитьОформляемоеПоле(ЭлементОформления.Поля.Элементы, "Поле");
	ДобавитьОформляемоеПоле(ЭлементОформления.Поля.Элементы, "Период");
	ДобавитьОформляемоеПоле(ЭлементОформления.Поля.Элементы, "Порядок");
	ДобавитьОформляемоеПоле(ЭлементОформления.Поля.Элементы, "Документ");
	ДобавитьОформляемоеПоле(ЭлементОформления.Поля.Элементы, "НомерСтроки");
	
	ДобавитьГруппуОформляемыхПолей(ЭлементОформления.Поля.Элементы, ЭтаФорма.Регистр, ОборотныйРегистр);
	
	//
	
	АдресСхемыИсполненногоОтчета = ПоместитьВоВременноеХранилище(Схема, ?(АдресСхемыИсполненногоОтчета <> "", АдресСхемыИсполненногоОтчета, УникальныйИдентификатор));
	
	ИсполняемыйКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыИсполненногоОтчета));
	ИсполняемыйКомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	// #501219 - убираем из доступных полей параметры СКД, т.к. использование в глобальном отборе параметра может вызвать ошибку.
	РаботаСОтчетами.ОбработатьПараметрыСхемыКомпоновкиИДобавитьПараметрыИзКомпоновщика(Схема, ИсполняемыйКомпоновщикНастроек);
	
КонецПроцедуры

//Форма
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Для каждого МетаданныеРегистрНакопления Из Метаданные.РегистрыНакопления Цикл
		ЭтаФорма.Элементы.Регистр.СписокВыбора.Добавить(МетаданныеРегистрНакопления.Имя, МетаданныеРегистрНакопления.Представление());
		Если ЭтаФорма.Регистр = "" Тогда
			ЭтаФорма.Регистр = МетаданныеРегистрНакопления.Имя;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Элементы.МакетОформления.СписокВыбора.Добавить("Основной", "Основной");
	ЭтаФорма.Элементы.МакетОформления.СписокВыбора.Добавить("Яркий", "Яркий");
	ЭтаФорма.Элементы.МакетОформления.СписокВыбора.Добавить("Море", "Море");
	ЭтаФорма.Элементы.МакетОформления.СписокВыбора.Добавить("Арктика", "Арктика");
	ЭтаФорма.Элементы.МакетОформления.СписокВыбора.Добавить("Зеленый", "Зеленый");
	ЭтаФорма.Элементы.МакетОформления.СписокВыбора.Добавить("Античный", "Античный");
	
	Если ЭтаФорма.Параметры["Расшифровка"] = Истина Тогда
		ЭтаФорма.Регистр = ЭтаФорма.Параметры["Регистр"];
		ЭтаФорма.НачалоПериода = ЭтаФорма.Параметры["НачалоПериода"];
		ЭтаФорма.КонецПериода = ЭтаФорма.Параметры["КонецПериода"];
		ЭтаФорма.СчетДоверительногоУправления = ЭтаФорма.Параметры["СчетДоверительногоУправления"];
		
		ИзменитьСхемуКомпоновкиДанных(Истина);
		Для каждого СтрокаОтбора Из ЭтаФорма.Параметры["Отбор"] Цикл
			// Ключ - это имя поля. В имени поля точки удаляются. Следовательно, если хотим сделать отбор на значение через точку, тогда необходимо в доступных искать левое значение, а не ключ.
			Если ЭтаФорма.ИсполняемыйКомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(СтрокаОтбора.Значение.ЛевоеЗначение)) <> Неопределено Тогда
				СвойстваОтбора = СтрокаОтбора.Значение;
				ЭлементОтбора = ЭтаФорма.ИсполняемыйКомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = ЭтаФорма.ИсполняемыйКомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(СвойстваОтбора.ЛевоеЗначение)).Поле;
				ЗаполнитьЗначенияСвойств(ЭлементОтбора, СвойстваОтбора, "ВидСравнения, ПравоеЗначение, Использование");
			КонецЕсли;
		КонецЦикла;
		ЭтаФорма.Расшифровка = Истина;
		СтандартнаяОбработка = Ложь;
	Иначе
		ИзменитьСхемуКомпоновкиДанных(Истина);
		ЭтаФорма.Расшифровка = Ложь;
	КонецЕсли;
	
	ПолноправныйПользователь = РаботаСПользователями.ЭтоПолноправныйПользователь();
	ЭтаФорма.Элементы.НастройкиИКомпоновщик.ОтображениеСтраниц = ?(ПолноправныйПользователь, ОтображениеСтраницФормы.ЗакладкиСверху, ОтображениеСтраницФормы.Нет);
	ЭтаФорма.Элементы.КомпоновщикНастройкиПолейНастройкиВыборПеренестиВВыбранныеПоля.Видимость = ПолноправныйПользователь;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ЗаполнитьСписокВыбораВидПериода(Перечисления.ДоступныеПериодыОтчета.День,
		ЭтаФорма.Элементы.ВидПериода.СписокВыбора, ЭтаФорма.ВидПериода);
	
	УправлениеФормой(ЭтаФорма);
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.НастройкиИКомпоновщик.ТекущаяСтраница = ЭтаФорма.Элементы.Настройки;
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Этаформа.Элементы.Результат, "НеАктуальность");
	Если ЭтаФорма.Расшифровка Тогда
		Сформировать();
	КонецЕсли;
	
КонецПроцедуры

//Расшифровки
&НаСервере
Функция ВернутьЗначениеРасшифровки(Расшифровка)
	
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресДанныхРасшифровки);
	
	ЗначанияПолейРасшифровки = ДанныеРасшифровкиОбъект .Элементы[Расшифровка].ПолучитьПоля();
	Если ЗначанияПолейРасшифровки.Количество() > 1 Тогда
	     Индекс = 1;
	Иначе
	     Индекс = 0;
	 КонецЕсли; 
	 
	ЗначениеРасшифровки = ЗначанияПолейРасшифровки[Индекс].Значение;
	
	Возврат ЗначениеРасшифровки;
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ЗначениеРасшифровки = ВернутьЗначениеРасшифровки(Расшифровка);
	
	ОткрытьЗначение(ЗначениеРасшифровки);
	
КонецПроцедуры

//Изменяшки
&НаКлиенте
Процедура РегистрПриИзменении(Элемент)
	
	Если ПустаяСтрока(ЭтаФорма.Регистр) Тогда
		ЭтаФорма.Регистр = Элементы.Регистр.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	
	ИзменитьСхемуКомпоновкиДанных(Истина);
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Этаформа.Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполняемыйКомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Этаформа.Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ИсполняемыйКомпоновщикНастроекНастройкиЭлементУсловноеОформлениеПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Этаформа.Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Этаформа.Элементы.Результат, "НеАктуальность");
КонецПроцедуры

//Расчет суммы
&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(Результат.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
		ПодключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	Сумма = 0;
	Для Каждого КлючИЗначение Из КэшВыделеннойОбласти Цикл
		СтруктураАдресВыделеннойОбласти = КлючИЗначение.Значение;
		Для ИндексСтрока = СтруктураАдресВыделеннойОбласти.Верх По СтруктураАдресВыделеннойОбласти.Низ Цикл
			Для ИндексКолонка = СтруктураАдресВыделеннойОбласти.Лево По СтруктураАдресВыделеннойОбласти.Право Цикл
				Попытка
					Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка, ИндексСтрока, ИндексКолонка);
					Если Ячейка.Видимость = Истина Тогда
						Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
							Сумма = Сумма + Ячейка.Значение;
						ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
							Сумма = Сумма + Число(СтрЗаменить(Ячейка.Текст, " ", ""));
						КонецЕсли;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КэшВыделеннойОбласти.Вставить("Сумма", Сумма);
	
	ПолеСумма = Сумма;
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимоОбновитьСумму(Результат, КэшВыделеннойОбласти)
	Перем СтруктураАдресВыделеннойОбласти;
	
	ВыделенныеОбласти    = Результат.ВыделенныеОбласти;
	КоличествоВыделенных = ВыделенныеОбласти.Количество();
	
	Если КоличествоВыделенных = 0 Тогда
		КэшВыделеннойОбласти = Новый Структура();
		Возврат Истина;
	КонецЕсли;
	
	ВозвращаемоеЗначение = Ложь;
	Если ТипЗнч(КэшВыделеннойОбласти) <> Тип("Структура") Тогда
		КэшВыделеннойОбласти = Новый Структура();
		ВозвращаемоеЗначение = Истина;
	ИначеЕсли ВыделенныеОбласти.Количество() <> КэшВыделеннойОбласти.Количество() Тогда
		КэшВыделеннойОбласти = Новый Структура();
		ВозвращаемоеЗначение = Истина;
	Иначе
		Для ИндексОбласти = 0 По КоличествоВыделенных - 1 Цикл
			ВыделеннаяОбласть = ВыделенныеОбласти[ИндексОбласти];
			ИмяОбласти = СтрЗаменить(ВыделеннаяОбласть.Имя, ":", "_");
			КэшВыделеннойОбласти.Свойство(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
			
			// не нашли нужную область в кэше, поэтому переинициализируем кэш
			Если ТипЗнч(СтруктураАдресВыделеннойОбласти) <> Тип("Структура") Тогда
				КэшВыделеннойОбласти = Новый Структура();
				ВозвращаемоеЗначение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для ИндексОбласти = 0 По КоличествоВыделенных - 1 Цикл
		ВыделеннаяОбласть = ВыделенныеОбласти[ИндексОбласти];
		ИмяОбласти = СтрЗаменить(ВыделеннаяОбласть.Имя, ":", "_");
		
		Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			СтруктураАдресВыделеннойОбласти = Новый Структура("Верх, Низ, Лево, Право", 0, 0, 0, 0);
			КэшВыделеннойОбласти.Вставить(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
			ВозвращаемоеЗначение = Истина;
			Продолжить;
		КонецЕсли;
		
		КэшВыделеннойОбласти.Свойство(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
		Если ТипЗнч(СтруктураАдресВыделеннойОбласти) <> Тип("Структура") Тогда
			СтруктураАдресВыделеннойОбласти = Новый Структура("Верх, Низ, Лево, Право", 0, 0, 0, 0);
			КэшВыделеннойОбласти.Вставить(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
			ВозвращаемоеЗначение = Истина;
		КонецЕсли;
		
		Если СтруктураАдресВыделеннойОбласти.Верх <> ВыделеннаяОбласть.Верх
			ИЛИ СтруктураАдресВыделеннойОбласти.Низ <> ВыделеннаяОбласть.Низ
			ИЛИ СтруктураАдресВыделеннойОбласти.Лево <> ВыделеннаяОбласть.Лево
			ИЛИ СтруктураАдресВыделеннойОбласти.Право <> ВыделеннаяОбласть.Право Тогда
				СтруктураАдресВыделеннойОбласти = Новый Структура("Верх, Низ, Лево, Право",
					ВыделеннаяОбласть.Верх, ВыделеннаяОбласть.Низ, ВыделеннаяОбласть.Лево, ВыделеннаяОбласть.Право);
				КэшВыделеннойОбласти.Вставить(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
				ВозвращаемоеЗначение = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере) Экспорт
	
	Если НеобходимоОбновитьСумму(Результат, КэшВыделеннойОбласти) Тогда
		ПолеСумма = 0;
		КоличествоВыделенныхОбластей = КэшВыделеннойОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0      // Ничего не выделено
			ИЛИ КэшВыделеннойОбласти.Свойство("T") // Выделен весь табличный документ (Ctrl+A)
			Тогда
			КэшВыделеннойОбласти.Вставить("Сумма", 0);
		ИначеЕсли КоличествоВыделенныхОбластей = 1 Тогда
			// Если выделено небольшое количество ячейек, то получим сумму на клиенте
			Для каждого КлючИЗначение Из КэшВыделеннойОбласти Цикл
				СтруктураАдресВыделеннойОбласти = КлючИЗначение.Значение;
			КонецЦикла;
			
			РазмерОбластиПоВертикали   = СтруктураАдресВыделеннойОбласти.Низ   - СтруктураАдресВыделеннойОбласти.Верх;
			РазмерОбластиПоГоризонтали = СтруктураАдресВыделеннойОбласти.Право - СтруктураАдресВыделеннойОбласти.Лево;
			
			// В некоторых отчетах показатели (да и аналитика на котрую может встать пользователь
			// выводятся в "объединенных" ячейках - не желательно в этом случае делать сервереный вызов. 
			// Выделенная область из 10 ячеек закрывает все такие случае и скорее всего всегда будет доступна на клиенте.
			// Максимум, может быть сделан один неявный серверный вызов
			ВычислитьНаКлиенте = (РазмерОбластиПоВертикали + РазмерОбластиПоГоризонтали) < 12;
			Если ВычислитьНаКлиенте Тогда
				СуммаВЯчейках = 0;
				Для ИндексСтрока = СтруктураАдресВыделеннойОбласти.Верх По СтруктураАдресВыделеннойОбласти.Низ Цикл
					Для ИндексКолонка = СтруктураАдресВыделеннойОбласти.Лево По СтруктураАдресВыделеннойОбласти.Право Цикл
						Попытка
							Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка, ИндексСтрока, ИндексКолонка);
							Если Ячейка.Видимость = Истина Тогда
								Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
									СуммаВЯчейках = СуммаВЯчейках + Ячейка.Значение;
								ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
									ЧислоВЯчейке  = Вычислить("Число(СтрЗаменить(Ячейка.Текст, Символ(32), Символ(0)))");
									СуммаВЯчейках = СуммаВЯчейках + ЧислоВЯчейке;
								КонецЕсли;
							КонецЕсли;
						Исключение
						КонецПопытки;
					КонецЦикла;
				КонецЦикла;
				
				ПолеСумма = СуммаВЯчейках;
				КэшВыделеннойОбласти.Вставить("Сумма", ПолеСумма);
			Иначе
				// Если ячеек много, то лучше вычислим сумму ячеек на сервере за один вызов,
				// т.к. неявных серверных вызовов может быть гораздо больше
				НеобходимоВычислятьНаСервере = Истина;
			КонецЕсли;
		Иначе
			// Вычислим сумму ячеек на сервере
			НеобходимоВычислятьНаСервере = Истина;
		КонецЕсли;
	Иначе	
		ПолеСумма = КэшВыделеннойОбласти.Сумма;
	КонецЕсли;
	
КонецПроцедуры

//Настройки
&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ДополнительныеСвойства = Новый Структура;
	
	ДополнительныеСвойства.Вставить("МакетОформления",					ЭтаФорма.МакетОформления);
	ДополнительныеСвойства.Вставить("Регистр",							ЭтаФорма.Регистр);
	
	ДополнительныеСвойства.Вставить("НастройкиКомпоновки",				ИсполняемыйКомпоновщикНастроек.ПолучитьНастройки());
	
	Настройки.ДополнительныеСвойства.Вставить("ДанныеОтчета", Новый ХранилищеЗначения(ДополнительныеСвойства));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если Настройки.ДополнительныеСвойства.Свойство("ДанныеОтчета") Тогда
		ДополнительныеСвойства = Настройки.ДополнительныеСвойства.ДанныеОтчета.Получить();
		Для Каждого ЭлементСтруктуры Из ДополнительныеСвойства Цикл
			Если ЭлементСтруктуры.Ключ = "МакетОформления" Тогда
				ЭтаФорма.МакетОформления = ЭлементСтруктуры.Значение;
			ИначеЕсли ЭлементСтруктуры.Ключ = "Регистр" Тогда
				ЭтаФорма.Регистр = ЭлементСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
		
		ИзменитьСхемуКомпоновкиДанных(Ложь);
		
		Для Каждого ЭлементСтруктуры Из ДополнительныеСвойства Цикл
			Если ЭлементСтруктуры.Ключ = "НастройкиКомпоновки" Тогда
				ЭтаФорма.ИсполняемыйКомпоновщикНастроек.ЗагрузитьНастройки(ЭлементСтруктуры.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

//Вспомогашки
&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	Для Каждого ДоступноеПоле Из ИсполняемыйКомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		ЭтоРесурс = Найти(ДоступноеПоле.Заголовок, " Конечный остаток") + 
					Найти(ДоступноеПоле.Заголовок, " Начальный остаток") + 
					Найти(ДоступноеПоле.Заголовок, " Оборот") + 
					Найти(ДоступноеПоле.Заголовок, " Приход") + 
					Найти(ДоступноеПоле.Заголовок, " Расход"); 
		Если ЭтоРесурс > 0 Тогда
			СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Процедура ПрименитьРучнуюНастройкуПолей()
	
	ИсполняемыйКомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	ЭлементыВыбораИсполняемогоКомпоновщика = ИсполняемыйКомпоновщикНастроек.Настройки.Выбор.Элементы;
	
	ДобавитьГлавныеПоля(ЭлементыВыбораИсполняемогоКомпоновщика, "Документ,Период,НомерСтроки,");
	
	ДобавитьЭлементыВыбора(ЭлементыВыбораИсполняемогоКомпоновщика, "Приход", "Приход");
	ДобавитьЭлементыВыбора(ЭлементыВыбораИсполняемогоКомпоновщика, "Расход", "Расход");
	ДобавитьЭлементыВыбора(ЭлементыВыбораИсполняемогоКомпоновщика, "Остаток", "Остаток");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГлавныеПоля(ЭлементыВыбораИсполняемогоКомпоновщика, СтрокаПолей);

	ИсточникПолей = КомпоновщикНастройкиПолей.Настройки.Выбор;
	
	Для каждого ЭлементВыбора Из ИсточникПолей.Элементы Цикл
	
		ИмяПоля = Строка(ЭлементВыбора.Поле) + ",";	
		
		Если СтрНайти(СтрокаПолей, ИмяПоля) > 0 Тогда
		
			ВыбранноеПоле = ЭлементыВыбораИсполняемогоКомпоновщика.Добавить(ТипЗнч(ЭлементВыбора));
			ЗаполнитьЗначенияСвойств(ВыбранноеПоле, ЭлементВыбора);
		
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыВыбора(ЭлементыВыбораИсполняемогоКомпоновщика, Заголовок, Вид)

	НоваяГруппа = ЭлементыВыбораИсполняемогоКомпоновщика.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	НоваяГруппа.Расположение = РасположениеПоляКомпоновкиДанных.Горизонтально;
	НоваяГруппа.Заголовок = Заголовок;
	
	ЗаполнитьСвойстваПолей(НоваяГруппа, КомпоновщикНастройкиПолей.Настройки.Выбор, Вид);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПолей(ПриемникПолей, ИсточникПолей, Вид)

	Для каждого ЭлементВыбора Из ИсточникПолей.Элементы Цикл
		
		Если ТипЗнч(ЭлементВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") И ЭлементВыбора.Заголовок = "Остаток" Тогда
			ВыбранноеПоле = ПриемникПолей;
		Иначе
			ВыбранноеПоле = ПриемникПолей.Элементы.Добавить(ТипЗнч(ЭлементВыбора));
			ЗаполнитьЗначенияСвойств(ВыбранноеПоле, ЭлементВыбора);
		КонецЕсли; 
		
		Если ТипЗнч(ЭлементВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(Строка(ЭлементВыбора.Поле) + Вид);
		ИначеЕсли ТипЗнч(ЭлементВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ЗаполнитьСвойстваПолей(ВыбранноеПоле, ЭлементВыбора, Вид);
		КонецЕсли; 
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ИзменитьСхемуКомпоновкиДанных(Истина, Ложь);
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВВыбранныеПоля(Команда)
		
	ПрименитьРучнуюНастройкуПолей();

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НачалоПериода > КонецПериода Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала периода не может быть больше даты конца периода!", , "НачалоПериода",,Отказ);
	КонецЕсли;
	
КонецПроцедуры
